{
    "Profile": {
        "Name": "Jarace Walker",
        "Height": "6'8\"",
        "Weight": "250 lbs",
        "Wingspan": "7' 2.50''",
        "Position": "Small Forward/Power Forward",
        "Birthdate": "September 4, 2003",
        "Nationality": "American"
    },
    "Statistics": {
        "Points Per Game (PPG)": 11.2,
        "Field Goal Percentage (FG%)": 46.5,
        "Three-Point Percentage (3P%)": 34.7,
        "Free Throw Percentage (FT%)": 66.3,
        "Assists Per Game (APG)": 1.8,
        "Turnovers Per Game (TOV)": 1.5,
        "Rebounds Per Game (RPG)": 6.8,
        "Offensive Rebounds Per Game (ORB)": 2.3,
        "Defensive Rebounds Per Game (DRB)": 4.5,
        "Steals Per Game (SPG)": 1.0,
        "Blocks Per Game (BPG)": 1.3,
        "Effective Field Goal Percentage (eFG%)": 51.6,
        "Player Efficiency Rating (PER)": "N/A"
    },
    "Background": {
        "College": "University of Houston",
        "High School": "IMG Academy",
        "Work Ethic": "Known for his physicality, defensive versatility, and rebounding effort.",
        "Mentality": "Strong two-way player who takes pride in impacting the game on both ends of the court."
    },
    "Report": {
        "Strength": "6’8 versatile forward/small ball five-man with a desirable modern skill set … Good length with a 7’2 wingspan … Filled out body frame with grown man strength. Plays well through contact and uses his body well … Very good mobility and athleticism. Effortless off the ground and doesn’t take a lot of time to load up when finishing, rebounding, or blocking shots … Good hands … Scores well inside/out and in iso situations. Rare combination of strength/power and finesse with soft touch scoring inside. Good pick and roll/pop potential. Shows a fadeaway and ability to score in the post … Scoring stats: 12.4 PPG 46.2% FG% Under Armour Association 2019, 10.6 PPG 56.3% FG% NBPA Top 100 2021, 5th best 16.7 PPG 2nd best 66% FG% NIBC 2021-22 … Shoots well from 3PT with good rotation coming out of his hand and high arc. Can pull up from midrange off the dribble … Good free throw shooter. Shot 84.8% FT% Under Armour Association 2019, 4th best 87.5% FT% NBPA Top 100 2021, 76.1% FT% NIBC 2021-22 … Good rebounder, pulls down with two hands and usually wins the battle if someone else has a hand on it. Can take a defensive rebound to the other end and start the offense. Averaged a 5th best 5.6 rebounds per game at the NBPA Top 100 in 2021 and a 2nd best 8.2 (2.4 offensive) rebounds per game over the NIBC in 2021-22 … Handles the ball well for his size with either hand and can push up the floor. Solid ability changing speed and direction with the ball. Moves well and shifty/swift with the ball for his size … Good court vision and passing ability in the half-court, post, or mid-drive. Alert and always has his head on a swivel. Doesn’t hold the ball, usually knows where he’s passing before he receives it. Averaged 3.5 assists per game over the NIBC in 2021-22 … Versatile defensively and good shot blocker. Averaged a 2nd best 2.2 blocks per game over the NIBC in 2021-22 … Sees the big picture on both ends and understands the roles/personnel of each individual on the court … Impacts the game in multiple areas …",
        "Weakness": "While versatile, he doesn’t have great lateral quickness when defending on the perimeter and he’s bit stiff in the hips … Can tighten up as a ball-handler, as he can get loose when making moves … Can still polish up as a finisher as he has a tendency to duck his way to the basket without a plan to eventually put a shot up. While it can work at this level, he’ll need to expand his offense a bit more as he progresses, and opponents match his size/strength and other gifts … Can add consistency to jump shot and speed up release. While the foundation is there, he isn’t a consistent threat stretching the floor yet. Shot 30.8% 3PT% on 1.3 3PT attempts per game over the NIBC in 2021-22 …",
        "Outlook": "Incoming Houston freshman … Recorded 11 points (5-10 FG), 7 rebounds, 4 assists, and 3 steals in the 2022 McDonald’s All-American … Played in the 2022 Nike Hoop Summit … Named to the 2022 Iverson Classic …",
        "Rating": {
            "Athleticism": 9,
            "Size": 8,
            "Defense": 8,
            "Strength": 8,
            "Quickness": 7,
            "Leadership": 6,
            "Jump Shot": 7,
            "NBA Ready": 8,
            "Ball Handling": 7,
            "Potential": 8,
            "Passing": 8,
            "Intangibles": 8
        },
        "NBA Comparison": "Tim Thomas",
        "Mock Draft": 7
    }
}
