{
    "Name": "Reed Sheppard",
    "Height": "6 ft 3 in (1.91 m)",
    "Weight": "180 lb",
    "Position": "Shooting Guard / Point Guard",
    "Birthdate": "June 24, 2004",
    "Nationality": "American",
    "Wingspan": "6 ft 3.25 in (1.91 m)",
    "Points Per Game (PPG)": 12.5,
    "Field Goal Percentage (FG%)": 53.6,
    "Three-Point Percentage (3P%)": 52.1,
    "Free Throw Percentage (FT%)": 83.1,
    "Assists Per Game (APG)": 4.5,
    "Turnovers Per Game (TOV)": 2.0,
    "Rebounds Per Game (RPG)": 4.1,
    "Offensive Rebounds Per Game (ORB)": 0.4,
    "Defensive Rebounds Per Game (DRB)": 3.8,
    "Steals Per Game (SPG)": 2.5,
    "Blocks Per Game (BPG)": 0.7,
    "Effective Field Goal Percentage (eFG%)": 67.9,
    "Player Efficiency Rating (PER)": 23.6,
    "College Background": "College Reed Sheppard, born on June 24, 2004, in London, Kentucky. He attended the University of Kentucky, where he had a standout freshman season. Throughout the regular season, Sheppard averaged 12.5 points, 4.1 rebounds, and 4.5 assists per game. He was named SEC Freshman of the Year by the conference coaches and earned national freshman of the year honors from both the United States Basketball Writers Association and the National Association of Basketball Coaches.",
    "High school Background": "Rated as high as No. 22 overall by ESPN … McDonald’s All-American … Mr. Kentucky Basketball in 2023 … Helped Team Ohio to win Junior International Championship in Italy and earned MVP honors after scoring 26 points in the title game … Averaged 22.5 points, 8.5 assists and 8.4 rebounds per game … Finished high school career with 3,727 career points … Led North Laurel to the state Sweet 16, averaging 25.2 points, 7.6 assists, 6.8 rebounds and 4.4 steals per game as a junior… 2022 Kentucky Gatorade Player of the Year.",
    "Work ethic": "His dedication to continuous improvement and commitment to the sport have been highlighted by coaches, teammates, and analysts. During his time at the University of Kentucky, head coach John Calipari praised Sheppard's relentless dedication, stating, \"He lives in that gym. He works and he’s made himself kind of like Shai [Gilgeous-Alexander] and some of these other kids that I’ve had. They build their own confidence.",
    "Report": {"NBA Comparison": "Mark Price/Jimmer Fredette",
"Strength": "This year’s “analytics darling”, Sheppard’s combination of shooting efficiency, defensive metrics and overall statistical portfolio has the analytics based pundits and teams extremely enticed by him … Exceedingly efficient shooter (52.1% from three, 53.6% overall) … Extremely unselfish player that looks to get others involved … Heady player that will not force shots … Can score from all three levels, but is most comfortable scoring from mid range and out … Comfortable shooting off the catch and off the bounce … Good elevation on his jumpshot with a high release point … Very good at making outlet passes up the court, getting his team extra transition opportunities … Gets teammates easy looks with his passes … Extremely disruptive on the defensive end … Is adept at getting deflections and steals, led the SEC in steals this past year … Uses his defense to create transition run outs for himself and teammates … Blocks shots regularly, both at the rim and on the perimeter … Good at throwing the lob when help side cuts off his drives. Low ego player – will fill in the gaps for a team and was willing to come off the bench for all but 5 games his freshman year … NBA moving towards a shooting oriented league with added 3 point value plays into a player like Reed Sheppard hands … A sneaky athlete who is surprisingly more athletic and quick than he appears …",
"Weakness": "Lacks the ideal size and physique for the next level … Despite his ability to make big plays on defense, often finds himself out of position or gambling for a big play … Is not the type of player to be a top option offensively for his team – works best as a glue guy/connector piece … Can struggle to get off shots against good defenses – lacks creation skills … Will occasionally force passes trying to make something happen and it will result in turnovers (averaged 2 turnovers per contest) … Scoring can be very up-and-down from game to game (7 games scoring 20 or more, 12 scoring fewer than 10) … Doesn’t have a lot of moves to breakdown defenders, relies primarily on using angles to get to his spots … May need some time to adjust to the speed and athleticism at the next level … Game isn’t very versatile – best suited playing a specific role …"},
"Rating": {"Athleticism": 8,
"Defense": 8,
"Size": 6,
"Shooting": 9}}
  