{
    "Profile": {
        "Name": "Olivier-Maxence Prosper",
        "Height": "6'8\"",
        "Weight": "230 lbs",
        "Wingspan": "7'1\"",
        "Position": "Forward",
        "Birthdate": "July 3, 2002",
        "Nationality": "Canadian"
    },
    "Statistics": {
        "Points Per Game (PPG)": 12.5,
        "Field Goal Percentage (FG%)": 51.2,
        "Three-Point Percentage (3P%)": 34.0,
        "Free Throw Percentage (FT%)": 73.0,
        "Assists Per Game (APG)": 0.7,
        "Turnovers Per Game (TOV)": 1.4,
        "Rebounds Per Game (RPG)": 4.7,
        "Offensive Rebounds Per Game (ORB)": 1.6,
        "Defensive Rebounds Per Game (DRB)": 3.1,
        "Steals Per Game (SPG)": 0.9,
        "Blocks Per Game (BPG)": 0.1,
        "Effective Field Goal Percentage (eFG%)": 54.5,
        "Player Efficiency Rating (PER)": 20.1
    },
    "Background": {
        "College": "Marquette",
        "High School": "NBA Academy Latin America",
        "Work Ethic": "Highly committed, strong focus on improving shooting and defense",
        "Mentality": "Competitive, team-first player with a defensive mindset"
    },
    "Report": {
        "Strength": "This man is strong. Long bodied forward who throws it down with authority, plays ferocious, tenacious defense, and is an interested and developing outside shooter … Excellent length, strength, and versatility. 7’1″ wingspan in a 6’8″ frame … When Prosper puts the ball on the floor it’s not the most fluid looking thing in the world. But he is able to impose his will (and strength) on the other team and get to the hole … Can reasonably be expected to defend positions 2-4 on ball, at minimum … The 3p shot is a relatively recent addition to his arsenal, but it is there, and continues to develop (34% this past season at Marquette) … At Marquette he was roughly a 76% FT shooter, proving he does have some shooting touch … Don’t let his basic box score stats fool you: A cornerstone of Prosper’s game is his defensive impact. He averaged a mind-bogglingly low 0.1 blocks per game across his entire college career, and less than 1 steal per game. However, his reputation is deserved — he is a dog on the defensive end … Very powerful, moves his feet well, applies constant pressure… About 1/3 of his rebounds were offensive rebounds",
        "Weakness": "Maybe we list blocks and steals as an area for improvement … They don’t tell the full defensive story, but they do at least play some part. And Prosper’s numbers in both were remarkably low in college … The 3-point shot is a relatively recent addition to his arsenal, and he is not yet a reliable outside shooter … While he is fairly accurate from mid-range, he will need to continue developing here and from outside to reach a level close to a Siakam type … Shot mechanics can improve … Often catches without his feet set, slowing his release … Takes a while to transfer the catch into the shot … Has not displayed much passing or playmaking ability … Turns the ball over at too high a rate … Has decent, but developing touch after a jump stop into a hook shot / floater in the lane … NOT overly quick. He is quite methodical in his movements … Rebounding numbers were underwhelming for a long athletic post player",
        "Outlook": "Projects as a 3&D wing with potential to be a key role player due to defensive versatility and improving shooting touch.",
        "Rating": {
            "Athleticism": 9,
            "Size": 8,
            "Defense": 8,
            "Strength": 7,
            "Quickness": 8,
            "Leadership": 7,
            "Jump Shoot": 7,
            "Ball Handling": 7,
            "Passing": 7,
            "Potential": 8
        },
        "NBA Comparison": "Al Thornton",
        "Mock Draft": 24
    }
}
